<a href="https://colab.research.google.com/github/julianovale/DATA_DataSciencePython/blob/main/Aula14_DataSciencePython.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# importando algumas das bibliotecas necessárias
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# importando a base de dados (trabalhada anteriormente nas aulas 8, 9 e 10)
url = 'https://raw.githubusercontent.com/julianovale/DATA_DataSciencePython/main/data/dados_editados.csv'
df = pd.read_csv(url)
df.head()

   PassengerId  Survived  Pclass  ...     Fare Embarked  Faixa etaria
0            2         1       1  ...  71.2833        C        Adulto
1            3         1       3  ...   7.9250        S        Adulto
2            4         1       1  ...  53.1000        S        Adulto
3            5         0       3  ...   8.0500        S        Adulto
4            6         0       3  ...   8.4583        Q        Adulto

[5 rows x 12 columns]

In [5]:
# verificando os nomes das colunas
df.columns.ravel()

array(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked', 'Faixa etaria'],
      dtype=object)

In [6]:
# limpando o DataFrame só para as colunas relevantes
df.drop(columns=['PassengerId','Name','Ticket','Faixa etaria'], inplace = True)
df.head()

   Survived  Pclass     Sex        Age  SibSp  Parch     Fare Embarked
0         1       1  female  38.000000      1      0  71.2833        C
1         1       3  female  26.000000      0      0   7.9250        S
2         1       1  female  35.000000      1      0  53.1000        S
3         0       3    male  35.000000      0      0   8.0500        S
4         0       3    male  29.709916      0      0   8.4583        Q

In [18]:
# fazendo o encoding: transformando features categóricas em numéricas, sob a técnica "One-hot-Encoding"
# a) verificando o tipo de cada coluna. As colunas do tipo object serão codificadas para variáveis dummy.
lista = []
for i in df.columns:
  if df[i].dtype == object:
    lista.append(i)

print(lista)

['Sex', 'Embarked']

In [19]:
# b) aplicando o one-hot encoding:
df = pd.get_dummies(df)
df.head()

   Survived  Pclass        Age  ...  Embarked_C  Embarked_Q  Embarked_S
0         1       1  38.000000  ...           1           0           0
1         1       3  26.000000  ...           0           0           1
2         1       1  35.000000  ...           0           0           1
3         0       3  35.000000  ...           0           0           1
4         0       3  29.709916  ...           0           1           0

[5 rows x 11 columns]

In [20]:
# normalizando os dados (transformando para a mesma escala)
# a) importando método do scikitlean:

from sklearn.preprocessing import MinMaxScaler

In [21]:
# b) aplicando normalização:

scaler = MinMaxScaler()
scaler.fit(df)
df = pd.DataFrame(scaler.transform(df), columns=df.columns)
df.head()

   Survived  Pclass       Age  ...  Embarked_C  Embarked_Q  Embarked_S
0       1.0     0.0  0.472229  ...         1.0         0.0         0.0
1       1.0     1.0  0.321438  ...         0.0         0.0         1.0
2       1.0     0.0  0.434531  ...         0.0         0.0         1.0
3       0.0     1.0  0.434531  ...         0.0         0.0         1.0
4       0.0     1.0  0.368056  ...         0.0         1.0         0.0

[5 rows x 11 columns]